<?
	
    $flag = true;
    $error = array();
    $ei = 0;
    $link = array();
    $li = 0;
    $ret_msg = "";
    $server_validation = true;


/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 0" : " idstaff এর মান ডাটাবেজ থেকে অানা হচ্ছে */
/*---------------------------------------------------------------------------------------*/

    $v1 = $qur->get_new_id('staff','idstaff');   

/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 0" : " idstaff এর মান ডাটাবেজ থেকে অানা শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/



    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* কর্মকর্তা / কর্মচারীর নাম" : " Employee এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('v2') == null){
            $msg = $msg. ($lang ? " কর্মকর্তা / কর্মচারীর নাম" : " Employee" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* কর্মকর্তা / কর্মচারীর নাম" : " Employee এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* প্রারম্ভিক ব্যালেন্স" : " Opening Balance এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(!check_numeric(req('v3'))){
            $msg = $msg. ($lang ? " প্রারম্ভিক ব্যালেন্স" : " Opening Balance" ).($lang ?  " সঠিক সংখ্যা নয়" : " is not a valid number." )."<br/>"; $flag = false;
        }
        if(req('v3') == null){
            $msg = $msg. ($lang ? " প্রারম্ভিক ব্যালেন্স" : " Opening Balance" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* প্রারম্ভিক ব্যালেন্স" : " Opening Balance এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* পদবী" : " Designation এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(!check_numeric(req('v4'))){
            $msg = $msg. ($lang ? " পদবী" : " Designation" ).($lang ?  " সঠিক সংখ্যা নয়" : " is not a valid number." )."<br/>"; $flag = false;
        }
        if(!check_integer(req('v4'))){
            $msg = $msg. ($lang ? " পদবী" : " Designation" ).($lang ?  " সংখ্যায় ভগ্নাংশ ব্যাবহার করা হয়েছে" : "  is a friction number." )."<br/>"; $flag = false;
        }
        if(req('v4') == null){
            $msg = $msg. ($lang ? " পদবী" : " Designation" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* পদবী" : " Designation এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }



/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 0" : " idstaff এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 1" : " staff_ob এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(!check_numeric(req('v3'))){
            $msg = $msg. ($lang ? " অনুবাদ 1" : " staff_ob" ).($lang ?  " সঠিক সংখ্যা নয়" : " is not a valid number." )."<br/>"; $flag = false;
        }
        if(req('v3') == null){
            $msg = $msg. ($lang ? " অনুবাদ 1" : " staff_ob" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 1" : " staff_ob এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 2" : " Remarks এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/

        if(req('d1') == null){
            $msg = $msg. ($lang ? " অনুবাদ 2" : " Remarks" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 2" : " Remarks এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 3" : " Registartion Date এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d2') == null){
            $msg = $msg. ($lang ? " অনুবাদ 3" : " Registartion Date" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 3" : " Registartion Date এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 4" : " Incentive Rate এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(!check_numeric(req('d3'))){
            $msg = $msg. ($lang ? " অনুবাদ 4" : " Incentive Rate" ).($lang ?  " সঠিক সংখ্যা নয়" : " is not a valid number." )."<br/>"; $flag = false;
        }
        if(req('d3') == null){
            $msg = $msg. ($lang ? " অনুবাদ 4" : " Incentive Rate" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 4" : " Incentive Rate এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 5" : " Cell Phone এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d4') == null){
            $msg = $msg. ($lang ? " অনুবাদ 5" : " Cell Phone" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 5" : " Cell Phone এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 6" : " Fathers Name এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d5') == null){
            $msg = $msg. ($lang ? " অনুবাদ 6" : " Fathers Name" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 6" : " Fathers Name এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 7" : " Date of Birth এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d6') == null){
            $msg = $msg. ($lang ? " অনুবাদ 7" : " Date of Birth" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 7" : " Date of Birth এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 8" : " Educational Qualification এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d7') == null){
            $msg = $msg. ($lang ? " অনুবাদ 8" : " Educational Qualification" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 8" : " Educational Qualification এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 9" : " Parmanent Address এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d8') == null){
            $msg = $msg. ($lang ? " অনুবাদ 9" : " Parmanent Address" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 9" : " Parmanent Address এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 10" : " NID এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d9') == null){
            $msg = $msg. ($lang ? " অনুবাদ 10" : " NID" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 10" : " NID এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 11" : " Reference Person এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('d10') == null){
            $msg = $msg. ($lang ? " অনুবাদ 11" : " Reference Person" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 11" : " Reference Person এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }


    if($server_validation){
		
/*---------------------------------------------------------------------------------------*/
/* অনুবাদ 12" : " Joning Date এর তথ্যের শুদ্ধিকরন যাচাই শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/
        if(req('v13') == null){
            $msg = $msg. ($lang ? " অনুবাদ 12" : " Joning Date" ).($lang ?  " খালি রাখা হয়েছে" : " is blank." )."<br/>"; $flag = false;
        }
/*---------------------------------------------------------------------------------------*/ 
/* অনুবাদ 12" : " Joning Date এর তথ্যের শুদ্ধিকরন শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/
     }




/*---------------------------------------------------------------------------------------*/
/* staff টেবিলে ডাটা প্রবেশ করানো শুরু হয়েছে */
/*---------------------------------------------------------------------------------------*/

    
    $query[0] = 'staff';
    $query[1] = 'isdi';
    $query[2] = array( 'idstaff' , 'staff_name' , 'staff_balance' , 'idpost' ); 
    $query[3] = array($v1,  req('v2'),  req('v3'),  req('v4') );

    if($flag){                
        $flag = $qur->insert_query_by_array($query);
        unset($query);
    }

	if($flag){
		$query1[0] = 'staff_details';
		$query1[1] = 'iddsdssssssss';
		$query1[2] = array( 'idstaff' , 'staff_ob' , 'staff_comments' , 'staff_reg_date' , 'staff_comission' , 'staff_mobile' , 'staff_father' , 'staff_dob' , 'staff_education' , 'staff_pad' , 'staff_nid' , 'staff_referene' , 'staff_od' ); 
		$query1[3] = array( $v1,  req('v3'),  req('d1'),  post_date('d2'),  req('d3'),  req('d4'),  req('d5'),  post_date('d6'),  req('d7'),  req('d8'),  req('d9'),  req('d10'),  post_date('v13') );
		$flag = $qur->insert_query_by_array($query1);
		unset($query1);
	}	

/*---------------------------------------------------------------------------------------*/
/* staff টেবিলে ডাটা প্রবেশ করানো শেষ হয়েছে */
/*---------------------------------------------------------------------------------------*/

    if($flag){
        $qur->con->commit();
        $ret_msg = ($lang ?  "সফলভাবে সম্পন্ন হয়েছে।" : "Successfully Done." );



    }
    else{
        $qur->con->rollback(); 
        $smsg = $qur->custom_select_query("SELECT @software_error");
        $ret_msg = $ret_msg.($lang ?  " দু:খিত, ব্যর্থ হয়েছে ।" : " Failed to do ." )."".$msg."".$smsg[0][0];
    }
	
    unset($query);
    $return_array['result'] = $flag;
    $return_array['return_msg'] = $ret_msg;
    $return_array['return_error'] = $error;
    $return_array['return_link'] = $link;
    echo json_encode($return_array);
    die();
?>
